from __future__ import annotations


FILM_TYPES = ["NC200", "AS100", "FS200"]

FILM_DESCRIPTIONS = {
    "NC200": """NC200: 灵感来自富士C200彩色负片和扫描仪 SP3000，旨在模仿经典的“富士色调”，通过还原“记忆色”，唤起对胶片的情感。""",
    "AS100": """AS100：灵感来自富士ACROS系列黑白胶片，为正全色黑白胶片，对蓝色最敏感，红色次之，绿色最弱，成片灰阶细腻，颗粒柔和，画面锐利。""",
    "FS200": """FS200：高对比度黑白正片⌈光⌋，在开发初期作为原理验证模型所使用，对蓝色较敏感，对红色较不敏感，对比鲜明，颗粒适中。""",
}


def film_choose(film_type: str):
    if film_type == ("NC200"):
        r_r = 0.77  # 红色感光层吸收的红光
        r_g = 0.12  # 红色感光层吸收的绿光
        r_b = 0.18  # 红色感光层吸收的蓝光
        g_r = 0.08  # 绿色感光层吸收的红光
        g_g = 0.85  # 绿色感光层吸收的绿光
        g_b = 0.23  # 绿色感光层吸收的蓝光
        b_r = 0.08  # 蓝色感光层吸收的红光
        b_g = 0.09  # 蓝色感光层吸收的绿光
        b_b = 0.92  # 蓝色感光层吸收的蓝光
        t_r = 0.25  # 全色感光层吸收的红光
        t_g = 0.35  # 全色感光层吸收的绿光
        t_b = 0.35  # 全色感光层吸收的蓝光
        color_type = ("color")  # 色彩类型
        sens_factor = 1.20  # 高光敏感系数
        d_r = 1.48  # 红色感光层接受的散射光
        l_r = 0.95  # 红色感光层接受的直射光
        x_r = 1.18  # 红色感光层的响应系数
        n_r = 0.18  # 红色感光层的颗粒度
        d_g = 1.02  # 绿色感光层接受的散射光
        l_g = 0.80  # 绿色感光层接受的直射光
        x_g = 1.02  # 绿色感光层的响应系数
        n_g = 0.18  # 绿色感光层的颗粒度
        d_b = 1.02  # 蓝色感光层接受的散射光
        l_b = 0.88  # 蓝色感光层接受的直射光
        x_b = 0.78  # 蓝色感光层的响应系数
        n_b = 0.18  # 蓝色感光层的颗粒度
        d_l = None  # 全色感光层接受的散射光
        l_l = None  # 全色感光层接受的直射光
        x_l = None  # 全色感光层的响应系数
        n_l = 0.08  # 全色感光层的颗粒度
        gamma = 2.05
        A = 0.15  # 肩部强度
        B = 0.50  # 线性段强度
        C = 0.10  # 线性段平整度
        D = 0.20  # 趾部强度
        E = 0.02  # 趾部硬度
        F = 0.30  # 趾部软度
    elif film_type == ("FS200"):
        r_r = 0  # 红色感光层吸收的红光
        r_g = 0  # 红色感光层吸收的绿光
        r_b = 0  # 红色感光层吸收的蓝光
        g_r = 0  # 绿色感光层吸收的红光
        g_g = 0  # 绿色感光层吸收的绿光
        g_b = 0  # 绿色感光层吸收的蓝光
        b_r = 0  # 蓝色感光层吸收的红光
        b_g = 0  # 蓝色感光层吸收的绿光
        b_b = 0  # 蓝色感光层吸收的蓝光
        t_r = 0.15  # 全色感光层吸收的红光
        t_g = 0.35  # 全色感光层吸收的绿光
        t_b = 0.45  # 全色感光层吸收的蓝光
        color_type = ("single")  # 色彩类型
        sens_factor = 1.0  # 高光敏感系数
        d_r = 0  # 红色感光层接受的散射光
        l_r = 0  # 红色感光层接受的直射光
        x_r = 0  # 红色感光层的响应系数
        n_r = 0  # 红色感光层的颗粒度
        d_g = 0  # 绿色感光层接受的散射光
        l_g = 0  # 绿色感光层接受的直射光
        x_g = 0  # 绿色感光层的响应系数
        n_g = 0  # 绿色感光层的颗粒度
        d_b = 0  # 蓝色感光层接受的散射光
        l_b = 0  # 蓝色感光层接受的直射光
        x_b = 0  # 蓝色感光层的响应系数
        n_b = 0  # 蓝色感光层的颗粒度
        d_l = 2.33  # 全色感光层接受的散射光
        l_l = 0.85  # 全色感光层接受的直射光
        x_l = 1.15  # 全色感光层的响应系数
        n_l = 0.20  # 全色感光层的颗粒度
        gamma = 2.2
        A = 0.15  # 肩部强度
        B = 0.50  # 线性段强度
        C = 0.10  # 线性段平整度
        D = 0.20  # 趾部强度
        E = 0.02  # 趾部硬度
        F = 0.30  # 趾部软度
    elif film_type == ("AS100"):
        r_r = 0  # 红色感光层吸收的红光
        r_g = 0  # 红色感光层吸收的绿光
        r_b = 0  # 红色感光层吸收的蓝光
        g_r = 0  # 绿色感光层吸收的红光
        g_g = 0  # 绿色感光层吸收的绿光
        g_b = 0  # 绿色感光层吸收的蓝光
        b_r = 0  # 蓝色感光层吸收的红光
        b_g = 0  # 蓝色感光层吸收的绿光
        b_b = 0  # 蓝色感光层吸收的蓝光
        t_r = 0.30  # 全色感光层吸收的红光
        t_g = 0.12  # 全色感光层吸收的绿光
        t_b = 0.45  # 全色感光层吸收的蓝光
        color_type = ("single")  # 色彩类型
        sens_factor = 1.28  # 高光敏感系数
        d_r = 0  # 红色感光层接受的散射光
        l_r = 0  # 红色感光层接受的直射光
        x_r = 0  # 红色感光层的响应系数
        n_r = 0  # 红色感光层的颗粒度
        d_g = 0  # 绿色感光层接受的散射光
        l_g = 0  # 绿色感光层接受的直射光
        x_g = 0  # 绿色感光层的响应系数
        n_g = 0  # 绿色感光层的颗粒度
        d_b = 0  # 蓝色感光层接受的散射光
        l_b = 0  # 蓝色感光层接受的直射光
        x_b = 0  # 蓝色感光层的响应系数
        n_b = 0  # 蓝色感光层的颗粒度
        d_l = 1.0  # 全色感光层接受的散射光
        l_l = 1.05  # 全色感光层接受的直射光
        x_l = 1.25  # 全色感光层的响应系数
        n_l = 0.10  # 全色感光层的颗粒度
        gamma = 2.0
        A = 0.15  # 肩部强度
        B = 0.50  # 线性段强度
        C = 0.25  # 线性段平整度
        D = 0.35  # 趾部强度
        E = 0.02  # 趾部硬度
        F = 0.35  # 趾部软度
    else:
        raise ValueError(f"Unknown film_type: {film_type}")

    return (
        r_r,
        r_g,
        r_b,
        g_r,
        g_g,
        g_b,
        b_r,
        b_g,
        b_b,
        t_r,
        t_g,
        t_b,
        color_type,
        sens_factor,
        d_r,
        l_r,
        x_r,
        n_r,
        d_g,
        l_g,
        x_g,
        n_g,
        d_b,
        l_b,
        x_b,
        n_b,
        d_l,
        l_l,
        x_l,
        n_l,
        gamma,
        A,
        B,
        C,
        D,
        E,
        F,
    )

